app/Controllers/Analitica.php

    public function comparativo(): string
    {
        $atendimentoModel = new AtendimentoModel();
        $moduloModel      = new ModuloModel();

        $todosModulos = $moduloModel->where('status', true)->orderBy('nome', 'ASC')->findAll();

        $selecionados = (array) ($this->request->getGet('modulos') ?? []);
        $selecionados = array_slice(array_unique(array_filter(array_map('intval', $selecionados))), 0, 3);

        if (empty($selecionados)) {
            $porVolume = $moduloModel->comEstatisticas();
            usort($porVolume, static fn ($a, $b) => $b['total_atendimentos'] <=> $a['total_atendimentos']);
            $selecionados = array_slice(array_column($porVolume, 'id'), 0, 2);
        }

        $periodo = $this->request->getGet('periodo') ?: null;

        $colunas = [];
        foreach ($selecionados as $id) {
            $modulo = $moduloModel->find($id);
---
SELECT *
FROM "modulos"
WHERE "status" = TRUE
ORDER BY "nome" ASC
SELECT *
FROM "modulos"
WHERE "modulos"."id" = '1'

    public function padroes(): string
    {
        $atendimentoModel = new AtendimentoModel();
        $moduloModel      = new ModuloModel();
        $tipoFalhaModel   = new TipoFalhaModel();

        $moduloId    = (int) ($this->request->getGet('modulo_id') ?? 0) ?: null;
        $tipoFalhaId = (int) ($this->request->getGet('tipo_falha_id') ?? 0) ?: null;
        $periodo     = $this->request->getGet('periodo') ?: null;

        $filtros = ['modulo_id' => $moduloId, 'tipo_falha_id' => $tipoFalhaId, 'periodo' => $periodo];

        $padroes          = $atendimentoModel->concentracaoPorTipoFalha($filtros);
        $totalGeralFiltro = array_sum(array_column($padroes, 'total_geral'));

        return view('analitica/padroes', [
            'titulo'           => 'Análise de Padrões',
            'modulos'          => $moduloModel->where('status', true)->orderBy('nome', 'ASC')->findAll(),
            'tiposFalha'       => $tipoFalhaModel->where('status', true)->orderBy('nome', 'ASC')->findAll(),
---
SELECT *
FROM "modulos"
WHERE "status" = TRUE
ORDER BY "nome" ASC
SELECT *
FROM "tipos_falha"
WHERE "status" = TRUE
ORDER BY "nome" ASC

    public function estimativa(): string
    {
        $atendimentoModel = new AtendimentoModel();
        $moduloModel      = new ModuloModel();
        $rotinaModel      = new RotinaModel();
        $tipoFalhaModel   = new TipoFalhaModel();

        $moduloId    = (int) ($this->request->getGet('modulo_id') ?? 0) ?: null;
        $rotinaId    = (int) ($this->request->getGet('rotina_id') ?? 0) ?: null;
        $tipoFalhaId = (int) ($this->request->getGet('tipo_falha_id') ?? 0) ?: null;

        $resultado = null;
        if ($rotinaId && $tipoFalhaId) {
            $resultado = $atendimentoModel->estimativaTempo($rotinaId, $tipoFalhaId);
        }

        return view('analitica/estimativa', [
            'titulo'      => 'Estimativa de Tempo',
            'modulos'     => $moduloModel->where('status', true)->orderBy('nome', 'ASC')->findAll(),
            'rotinas'     => $rotinaModel->where('status', true)->orderBy('nome', 'ASC')->findAll(),
            'tiposFalha'  => $tipoFalhaModel->where('status', true)->orderBy('nome', 'ASC')->findAll(),
---
SELECT *
FROM "modulos"
WHERE "status" = TRUE
ORDER BY "nome" ASC
SELECT *
FROM "rotinas"
WHERE "status" = TRUE
ORDER BY "nome" ASC
SELECT *
FROM "tipos_falha"
WHERE "status" = TRUE
ORDER BY "nome" ASC

            ];
        }

        return view('analitica/evolucao', [
            'titulo'         => 'Evolução dos Indicadores',
            'modulos'        => $moduloModel->where('status', true)->orderBy('nome', 'ASC')->findAll(),
            'periodos'       => $periodos,
            'moduloId'       => $moduloId,
            'periodoSelecionado' => $periodo,
            'semanas'        => $semanas,
            'destaques'      => $destaques,
        ]);
---
SELECT *
FROM "modulos"
WHERE "status" = TRUE
ORDER BY "nome" ASC


        usort($relacoes, static fn ($a, $b) => $b['eta2'] <=> $a['eta2']);

        return view('analitica/relacoes', [
            'titulo'    => 'Análise de Relações',
            'modulos'   => $moduloModel->where('status', true)->orderBy('nome', 'ASC')->findAll(),
            'periodos'  => $atendimentoModel->periodosDisponiveis(),
            'moduloId'  => $moduloId,
            'periodo'   => $periodo,
            'relacoes'  => $relacoes,
        ]);
---
SELECT *
FROM "modulos"
WHERE "status" = TRUE
ORDER BY "nome" ASC