app/Models/AtendimentoModel.php

SELECT "tipos_falha"."nome" as "tipo_falha", COUNT(*) as total
FROM "atendimentos"
JOIN "tipos_falha" ON "tipos_falha"."id" = "atendimentos"."tipo_falha_id"
GROUP BY "tipos_falha"."nome"
ORDER BY "total" DESC
 LIMIT 6
---
    public function falhasRecorrentes(int $limite = 10)
    {
        return $this->select('tipos_falha.nome as tipo_falha, COUNT(*) as total')
            ->join('tipos_falha', 'tipos_falha.id = atendimentos.tipo_falha_id')
            ->groupBy('tipos_falha.nome')
            ->orderBy('total', 'DESC')
            ->limit($limite)
            ->findAll();

SELECT DISTINCT to_char(data_abertura, 'YYYY-MM') as periodo
FROM "atendimentos"
ORDER BY "periodo" DESC
---
    public function periodosDisponiveis(): array
    {
        $linhas = $this->db->table('atendimentos')
            ->select("DISTINCT to_char(data_abertura, 'YYYY-MM') as periodo", false)
            ->orderBy('periodo', 'DESC')
            ->get()
            ->getResultArray();

SELECT tf.id as tipo_falha_id,
                tf.nome as tipo_falha_nome,
                r.nome as rotina_nome,
                m.nome as modulo_nome,
                COUNT(*) as total
FROM "atendimentos" "a"
INNER JOIN "rotinas" "r" ON "r"."id" = "a"."rotina_id"
JOIN "tipos_falha" "tf" ON "tf"."id" = "a"."tipo_falha_id"
JOIN "modulos" "m" ON "m"."id" = "r"."modulo_id"
GROUP BY "tf"."id", "tf"."nome", "r"."nome", "m"."nome"
ORDER BY "tf"."nome" ASC, "total" DESC
---
    public function concentracaoPorTipoFalha(array $filtros = []): array
    {
        $linhas = $this->aplicarFiltros($this->builderComRotina(), $filtros)
            ->join('tipos_falha tf', 'tf.id = a.tipo_falha_id')
            ->join('modulos m', 'm.id = r.modulo_id')
            ->select("
                tf.id as tipo_falha_id,
                tf.nome as tipo_falha_nome,
                r.nome as rotina_nome,
                m.nome as modulo_nome,
                COUNT(*) as total
            ", false)
            ->groupBy('tf.id, tf.nome, r.nome, m.nome')
            ->orderBy('tf.nome', 'ASC')
            ->orderBy('total', 'DESC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) as total,
                COALESCE(PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY minutos_uteis(data_resposta, data_fechamento)), 0) as mediana_min,
                MIN(minutos_uteis(data_resposta, data_fechamento)) as minimo_min,
                MAX(minutos_uteis(data_resposta, data_fechamento)) as maximo_min
FROM "atendimentos"
WHERE "rotina_id" = 18
AND "tipo_falha_id" = 2
---
    public function estimativaTempo(int $rotinaId, int $tipoFalhaId): array
    {
        $linha = $this->db->table('atendimentos')
            ->select("
                COUNT(*) as total,
                COALESCE(PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY minutos_uteis(data_resposta, data_fechamento)), 0) as mediana_min,
                MIN(minutos_uteis(data_resposta, data_fechamento)) as minimo_min,
                MAX(minutos_uteis(data_resposta, data_fechamento)) as maximo_min
            ", false)
            ->where('rotina_id', $rotinaId)
            ->where('tipo_falha_id', $tipoFalhaId)
            ->get()
            ->getRowArray();

SELECT ma.nome as modo, COUNT(*) as total
FROM "atendimentos" "a"
JOIN "modos_atendimento" "ma" ON "ma"."id" = "a"."modo_atendimento_id"
GROUP BY "ma"."nome"
ORDER BY "total" DESC
---
    public function porModoAtendimento(): array
    {
        return $this->db->table('atendimentos a')
            ->select('ma.nome as modo, COUNT(*) as total', false)
            ->join('modos_atendimento ma', 'ma.id = a.modo_atendimento_id')
            ->groupBy('ma.nome')
            ->orderBy('total', 'DESC')
            ->get()
            ->getResultArray();

SELECT tf.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min
FROM "atendimentos" "a"
INNER JOIN "rotinas" "r" ON "r"."id" = "a"."rotina_id"
JOIN "tipos_falha" "tf" ON "tf"."id" = "a"."tipo_falha_id"
WHERE to_char(a.data_abertura, 'YYYY-MM') = '2026-09'
AND a.data_fechamento IS NOT NULL
GROUP BY "tf"."nome"
ORDER BY "tempo_medio_min" DESC
 LIMIT 1
---
    public function maiorTempoPorTipoFalha(array $filtros = []): ?array
    {
        $linha = $this->aplicarFiltros($this->builderComRotina(), $filtros)
            ->join('tipos_falha tf', 'tf.id = a.tipo_falha_id')
            ->where('a.data_fechamento IS NOT NULL', null, false)
            ->select('tf.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min', false)
            ->groupBy('tf.nome')
            ->orderBy('tempo_medio_min', 'DESC')
            ->limit(1)
            ->get()
            ->getRowArray();

SELECT m.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min
FROM "atendimentos" "a"
INNER JOIN "rotinas" "r" ON "r"."id" = "a"."rotina_id"
JOIN "modulos" "m" ON "m"."id" = "r"."modulo_id"
WHERE to_char(a.data_abertura, 'YYYY-MM') = '2026-09'
AND a.data_fechamento IS NOT NULL
GROUP BY "m"."nome"
ORDER BY "tempo_medio_min" DESC
 LIMIT 1
---
    public function maiorTempoPorModulo(array $filtros = []): ?array
    {
        $linha = $this->aplicarFiltros($this->builderComRotina(), $filtros)
            ->join('modulos m', 'm.id = r.modulo_id')
            ->where('a.data_fechamento IS NOT NULL', null, false)
            ->select('m.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min', false)
            ->groupBy('m.nome')
            ->orderBy('tempo_medio_min', 'DESC')
            ->limit(1)
            ->get()
            ->getRowArray();

SELECT ma.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min
FROM "atendimentos" "a"
INNER JOIN "rotinas" "r" ON "r"."id" = "a"."rotina_id"
JOIN "modos_atendimento" "ma" ON "ma"."id" = "a"."modo_atendimento_id"
WHERE to_char(a.data_abertura, 'YYYY-MM') = '2026-09'
AND a.data_fechamento IS NOT NULL
GROUP BY "ma"."nome"
ORDER BY "tempo_medio_min" DESC
 LIMIT 1
---
    public function maiorTempoPorModoAtendimento(array $filtros = []): ?array
    {
        $linha = $this->aplicarFiltros($this->builderComRotina(), $filtros)
            ->join('modos_atendimento ma', 'ma.id = a.modo_atendimento_id')
            ->where('a.data_fechamento IS NOT NULL', null, false)
            ->select('ma.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min', false)
            ->groupBy('ma.nome')
            ->orderBy('tempo_medio_min', 'DESC')
            ->limit(1)
            ->get()
            ->getRowArray();