app/Models/AtendimentoModel.php

    public function porModoAtendimento(): array
    {
        return $this->db->table('atendimentos a')
            ->select('ma.nome as modo, COUNT(*) as total', false)
            ->join('modos_atendimento ma', 'ma.id = a.modo_atendimento_id')
            ->groupBy('ma.nome')
            ->orderBy('total', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT ma.nome as modo, COUNT(*) as total
FROM "atendimentos" "a"
JOIN "modos_atendimento" "ma" ON "ma"."id" = "a"."modo_atendimento_id"
GROUP BY "ma"."nome"
ORDER BY "total" DESC

    public function maiorTempoPorModoAtendimento(array $filtros = []): ?array
    {
        $linha = $this->aplicarFiltros($this->builderComRotina(), $filtros)
            ->join('modos_atendimento ma', 'ma.id = a.modo_atendimento_id')
            ->where('a.data_fechamento IS NOT NULL', null, false)
            ->select('ma.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min', false)
            ->groupBy('ma.nome')
            ->orderBy('tempo_medio_min', 'DESC')
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT ma.nome as nome, AVG(minutos_uteis(a.data_resposta, a.data_fechamento)) as tempo_medio_min
FROM "atendimentos" "a"
INNER JOIN "rotinas" "r" ON "r"."id" = "a"."rotina_id"
JOIN "modos_atendimento" "ma" ON "ma"."id" = "a"."modo_atendimento_id"
WHERE a.data_fechamento IS NOT NULL
GROUP BY "ma"."nome"
ORDER BY "tempo_medio_min" DESC
 LIMIT 1