app/Models/ModuloModel.php

SELECT m.id,
                m.nome,
                COUNT(DISTINCT r.id) as total_rotinas,
                COUNT(a.id) as total_atendimentos,
                COALESCE(AVG(minutos_uteis(a.data_resposta, a.data_fechamento)), 0) as tempo_medio_min
FROM "modulos" "m"
LEFT JOIN "rotinas" "r" ON "r"."modulo_id" = "m"."id"
LEFT JOIN "atendimentos" "a" ON "a"."rotina_id" = "r"."id"
WHERE "m"."status" = TRUE
GROUP BY "m"."id", "m"."nome"
ORDER BY "m"."nome" ASC
---
    public function comEstatisticas(): array
    {
        return $this->db->table('modulos m')
            ->select("
                m.id,
                m.nome,
                COUNT(DISTINCT r.id) as total_rotinas,
                COUNT(a.id) as total_atendimentos,
                COALESCE(AVG(minutos_uteis(a.data_resposta, a.data_fechamento)), 0) as tempo_medio_min
            ", false)
            ->join('rotinas r', 'r.modulo_id = m.id', 'left')
            ->join('atendimentos a', 'a.rotina_id = r.id', 'left')
            ->where('m.status', true)
            ->groupBy('m.id, m.nome')
            ->orderBy('m.nome', 'ASC')
            ->get()
            ->getResultArray();