app/Models/RotinaModel.php

    public function estatisticasPorId(int $id): ?array
    {
        $resultado = $this->db->table('rotinas r')
            ->select("
                r.id,
                r.nome,
                r.modulo_id,
                m.nome as modulo_nome,
                COUNT(a.id) as total_atendimentos,
                COALESCE(SUM(minutos_uteis(a.data_resposta, a.data_fechamento)), 0) as tempo_total_min,
                COALESCE(AVG(minutos_uteis(a.data_resposta, a.data_fechamento)), 0) as tempo_medio_min
            ", false)
            ->join('modulos m', 'm.id = r.modulo_id')
            ->join('atendimentos a', 'a.rotina_id = r.id', 'left')
            ->where('r.id', $id)
            ->groupBy('r.id, r.nome, r.modulo_id, m.nome')
            ->get()
            ->getRowArray();
---
SELECT r.id,
                r.nome,
                r.modulo_id,
                m.nome as modulo_nome,
                COUNT(a.id) as total_atendimentos,
                COALESCE(SUM(minutos_uteis(a.data_resposta, a.data_fechamento)), 0) as tempo_total_min,
                COALESCE(AVG(minutos_uteis(a.data_resposta, a.data_fechamento)), 0) as tempo_medio_min
FROM "rotinas" "r"
JOIN "modulos" "m" ON "m"."id" = "r"."modulo_id"
LEFT JOIN "atendimentos" "a" ON "a"."rotina_id" = "r"."id"
WHERE "r"."id" = 2
GROUP BY "r"."id", "r"."nome", "r"."modulo_id", "m"."nome"